[
  {
    "name": "Anne -- 2017 Camaro ZL1",
    "quote": "Excellent service from Brian A. at Zen Brokers. Brian was attentive 7 days a week any time of day. Smooth, uneventful transaction that got me the car I wanted. I would recommend Brian and Zen Brokers to a friend.",
    "image": "2017-Camaro-ZL1.jpeg",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "“Bitchin’ Camaro”",
    "location": "Fleetwood, Pennsylvania"
  },
  {
    "name": "Reid -- 2025 Lexus RX 350",
    "quote": "Brian Alexander is outstanding! He followed up on every detail and was available on a moment’s notice. He was tenacious with the car dealers we approached and got us a very fair deal. He’s the best car person I have dealt with.",
    "image": "2025-lexus-rx-350.png",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "Outstanding service and a very fair deal",
    "location": "Denver, Colorado"
  },
  {
    "name": "Ian -- 2021 Ford F150",
    "quote": "This was my first time using an auto broker and I only wish I had considered it years ago. I’m so glad I found Brian. Not only is he extremely knowledgeable, but he was also prompt to answer any questions I had and had great advice on things I hadn’t even considered. The time saved looking for vehicles, not to mention the brain damage saved having to negotiate with salespeople was invaluable to me. I was also amazed at the range of vehicles he had knowledge of, from new electric vehicles to vintage, he can do it all. I highly recommend Brian to find the perfect vehicle for you with terms that would be difficult to obtain on your own. He far exceeded my expectations.",
    "image": "2021-ian-f150.png",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "Should’ve used an auto broker years ago",
    "location": "Niwot, Colorado"
  },
  {
    "name": "Eric -- 2024 Escalade",
    "quote": "Was an absolute pleasure dealing with Brian. He was extremely thorough and communication was awesome! Will happily buy my next car with him and his team! Thank you!",
    "image": "zen-car-buying-review-eric-escalade.png",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "Lightly used Luxury saved tens of thousands",
    "location": "Weston, Massachusetts"
  },
  {
    "name": "Lisa -- 2024 Hyundai",
    "quote": "100% Satisfaction using Zen Car! Brian gave continuous options and stayed at our price point! We couldn’t be happier with our experience and the car Brian found for us!",
    "image": "2024-lisa-success.png",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "High mileage success!",
    "location": "Redondo Beach, California"
  },
  {
    "name": "Ashley -- 2025 Subaru Forester",
    "quote": "I worked with Brian Alexander to lease a car out of state for my mom, which could have been an huge headache but he honestly made the whole thing so easy. He found her a great deal, handled all the legwork, and made sure she’d be taken care of by the dealership once the lease was set up. Even the guy at the dealership said Brian was the best broker he’d ever worked with and asked me, “Where’d you find him?”",
    "image": "2025-Subaru-Forester-Premium.jpg",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "Best broker I've ever worked with!",
    "location": "Bodega Bay, California"
  },
  {
    "name": "Mary -- 2025 Subaru Solterra",
    "quote": "I recently leased a 2025 Subaru Solterra through Zen Car Buying and it was by far the best car-buying experience I’ve ever had. Brian handled everything from researching the best EV SUV options and incentives to calling multiple dealerships and negotiating directly with sales managers. He kept me updated every step of the way and ultimately landed me an incredible lease deal on a fully loaded Solterra. Picking up the car was effortless—everything was ready, no upselling, and I was out in two hours. The process was stress-free, transparent, and truly felt like having someone on my side. I can’t recommend Zen Car Buying enough!",
    "image": "subaru-solterra-ev-2025.png",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "The best experience I ever had!",
    "location": "Langhorne, Pennsylvania"
  },
  {
    "name": "John -- 1967 Pontiac LeMans",
    "quote": "Anyone thinking of buying on-line i would suggest using a auto broker. When you are looking for that certain car and you have a lot of money on the line. Zen car buying helped me find and procure my dream car. Brian at Zen was amazing and made the whole process easy and and clear on how the process worked. With all the scams on-line this was well worth the assurance with having the help experience in on-line buying. There were some issues with trucking but Brian was on top of it and got it handled in a timely manner. I can't say anything bad about my experience with Zen car buying.",
    "image": "john-1967-pontiac-lemans-zen-car-buying-concierge.jpeg",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "Dream Car Come True",
    "location": "Kingsley, Pennsylvania"
  },
  {
    "name": "Gary -- 2021 Jeep Wrangler Unlimited",
    "quote": "Brian did a great job finding the vehicle I was looking for. Very satisfied and would recommend his service for anyone looking to avoid the usual hassle!",
    "image": "gary-2021-jeep-wrangler-unlimited-zen-car-buying-concierge-review.jpeg",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "Exactly the Car I Wanted – Hassle-Free",
    "location": "Hemet, California"
  },
  {
    "name": "Anand -- 2025 BMW i5",
    "quote": "If you are looking for worry free, trouble free leasing or buying a car experience, look no further than Zen. From initial consultations, sourcing the right vehicle, negotiations to the final paperwork, everything was done flawlessly. Brian was a trusted advisor throughout the process. Highly recommended.",
    "image": "anad-m-zen-car-buying-concierge.jpeg",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "Saved $20k off MSRP",
    "location": "Novi, Michigan"
  },
  {
    "name": "Vicky -- 2025 Kia Soul",
    "quote": "I had an amazing experience with Zen Car Buying - I never knew a car concierge service like this existed! As a senior, buying a car can feel overwhelming, but they made it completely stress-free. I was looking for a Kia Soul, and they sourced great options, coordinated with dealerships to get photos, videos, and walkthroughs, and negotiated an excellent deal. They even helped process all the paperwork and delivered the car right to me. Their white glove service was professional, patient, and incredibly helpful. I love my new Kia Soul and truly appreciate how Zen Car Buying made the process simple, smooth, and enjoyable. Highly recommend!",
    "image": "vicky-zen-car-buying.jpeg",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "Stress-free, white glove car concierge service for seniors and everyone!",
    "location": "The Villages, Florida"
  },
  {
    "name": "Allan -- 2024 Hyundai Ioniq 6",
    "quote": "My Zen Guide helped me navigate the confusing EV marketplace with ease. I couldn’t be happier with my new Ioniq 6.",
    "image": "Allan-A.jpeg",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "I saved more than 20% off of the MSRP",
    "location": "Akron, Ohio"
  },
  {
    "name": "Andrew -- 2019 Audi eTron Prestige",
    "quote": "I was shopping for the new Cadillac Lyriq electric SUV. The lease payments were crazy high! I reached out to Zen Car Buying to see if they could help and they turned me onto the idea of purchasing a slightly used luxury SUV EV. My Zen Guide educated me on the EV market and why buying used is a smart move. I couldn't be happier with my eTron, it even has massaging seats!",
    "image": "andy-zen-car-buying.jpeg",
    "rating": "⭐⭐⭐⭐⭐",
    "note": "I love this SUV",
    "location": "Los Angeles, California"
  }
]
